# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'doctl'
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config'
brew 'svn'

# Development
brew 'php'
brew 'php@7.4'
brew 'php@8.0'
brew 'composer'
brew 'node'

# Apps
cask '1password'
cask 'docker'
cask 'firefox'
cask 'forklift'
cask 'google-chrome'
cask 'google-drive'
cask 'gpg-suite'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'parallels'
cask 'paw'
cask 'phpstorm'
cask 'spotify'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'vagrant'
cask 'viscosity'
cask 'visual-studio-code'
cask 'vlc'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Magnet', id: 441258766
mas 'Xcode', id: 497799835
