# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config'
brew 'svn'
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'

# Apps
cask '1password-cli'
cask '1password'
cask 'dbngin'
cask 'docker'
cask 'firefox'
cask 'forklift'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'paw'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'vagrant'
cask 'virtualbox-extension-pack'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'visual-studio-code'
cask 'vlc'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Magnet', id: 441258766
mas 'Todoist', id: 585829637
mas 'The Unarchiver', id: 425424353
mas 'Xcode', id: 497799835
